Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame([4,8,15,16,23,42])

In [6]:
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
l = [4,7,8,9,65,33,4,66,23,74]

df = pd.DataFrame(l)

In [9]:
df

    0
0   4
1   7
2   8
3   9
4  65
5  33
6   4
7  66
8  23
9  74

In [18]:
data ={'Name':('Alice','Bob','Claire'),'Age':(25,30,27),'Gender':('Female','Male','Female')}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

df.iloc(:,0)
df.columns
df.describe()
df.info()

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


Q7. Create a DataFrame using multiple Series. Explain with an example.